In [1]:
import pandas as pd
from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb()
import socket

In [2]:
csv_file = "Resources/toptenclean_df.csv"
movie_data = pd.read_csv(csv_file)
movie_data.head()

,Unnamed: 0,Movie,Ten,Nine,Eight,Seven,Six,Five,Four,Three,Two,One_,Rank Score,Rank_Score
0,32,Get Out,1,4,5,2,3,5,2,2,4,10,243,243
1,51,Logan,0,0,1,1,4,3,7,3,5,4,203,203
2,26,Dunkirk,3,0,1,3,1,1,4,5,6,5,201,201
3,12,Blade Runner 2049,5,0,1,1,3,2,3,0,2,5,128,128
4,17,Call Me by Your Name,0,1,1,0,2,2,2,5,3,0,108,108

In [3]:
movie_data = movie_data[["Movie", "Ten", "Nine", "Eight", "Seven", "Six", "Five", "Four", "Three", "Two", "One_", "Rank_Score"]]
movie_data.head()

,Movie,Ten,Nine,Eight,Seven,Six,Five,Four,Three,Two,One_,Rank_Score
0,Get Out,1,4,5,2,3,5,2,2,4,10,243
1,Logan,0,0,1,1,4,3,7,3,5,4,203
2,Dunkirk,3,0,1,3,1,1,4,5,6,5,201
3,Blade Runner 2049,5,0,1,1,3,2,3,0,2,5,128
4,Call Me by Your Name,0,1,1,0,2,2,2,5,3,0,108

In [4]:
movie_data = movie_data.rename(columns={"Movie": "title"})
movie_data.head()

,title,Ten,Nine,Eight,Seven,Six,Five,Four,Three,Two,One_,Rank_Score
0,Get Out,1,4,5,2,3,5,2,2,4,10,243
1,Logan,0,0,1,1,4,3,7,3,5,4,203
2,Dunkirk,3,0,1,3,1,1,4,5,6,5,201
3,Blade Runner 2049,5,0,1,1,3,2,3,0,2,5,128
4,Call Me by Your Name,0,1,1,0,2,2,2,5,3,0,108

In [5]:
csv = "Resources/anticipated_df.csv"
anticipated_data = pd.read_csv(csv)
anticipated_data.head()

   Unnamed: 0  rank                             title
0           0    30                           Jumanji
1           1    29  King Arthur: Legend of the Sword
2           2    28                          Baywatch
3           3    27       Kingsman: The Golden Circle
4           4    26                         The Mummy

In [6]:
anticipated_data = anticipated_data[["rank", "title"]]
anticipated_data.head()

   rank                             title
0    30                           Jumanji
1    29  King Arthur: Legend of the Sword
2    28                          Baywatch
3    27       Kingsman: The Golden Circle
4    26                         The Mummy

In [7]:
title_max = anticipated_data['title'].apply(str).map(len).max()
title_max

51

In [8]:
socket.getaddrinfo('localhost', 3306)

[(<AddressFamily.AF_INET6: 30>,
  <SocketKind.SOCK_DGRAM: 2>,
  17,
  '',
  ('::1', 3306, 0, 0)),
 (<AddressFamily.AF_INET6: 30>,
  <SocketKind.SOCK_STREAM: 1>,
  6,
  '',
  ('::1', 3306, 0, 0)),
 (<AddressFamily.AF_INET: 2>,
  <SocketKind.SOCK_DGRAM: 2>,
  17,
  '',
  ('127.0.0.1', 3306)),
 (<AddressFamily.AF_INET: 2>,
  <SocketKind.SOCK_STREAM: 1>,
  6,
  '',
  ('127.0.0.1', 3306))]

In [9]:

engine = create_engine("mysql://root:G00seBu$@localhost:3306/movierank1_db")
con = engine.connect()

In [10]:
engine.table_names()

['anticipated_movies', 'critical_darlings']

In [11]:
anticipated_data.to_sql(name='anticipated_movies', con=engine, if_exists='append', index=False)

In [12]:
movie_data.to_sql(name='critical_darlings', con=engine, if_exists='append', index=False)

In [13]:
pd.read_sql_query('select * from critical_darlings', con=engine).head()

,id,title,Ten,Nine,Eight,Seven,Six,Five,Four,Three,Two,One_,Rank_Score
0,1,Get Out,1,4,5,2,3,5,2,2,4,10,243
1,2,Logan,0,0,1,1,4,3,7,3,5,4,203
2,3,Dunkirk,3,0,1,3,1,1,4,5,6,5,201
3,4,Blade Runner 2049,5,0,1,1,3,2,3,0,2,5,128
4,5,Call Me by Your Name,0,1,1,0,2,2,2,5,3,0,108

In [14]:
pd.read_sql_query('select * from anticipated_movies', con=engine).head()

   id  rank                             title
0   1    30                           Jumanji
1   2    29  King Arthur: Legend of the Sword
2   3    28                          Baywatch
3   4    27       Kingsman: The Golden Circle
4   5    26                         The Mummy

In [27]:
joined_df = pd.read_sql_query('SELECT critical_darlings.title as Movie_Title, critical_darlings.Rank_Score AS Critical_Score, anticipated_movies.rank AS Anticipated_Rank FROM critical_darlings LEFT JOIN anticipated_movies ON critical_darlings.title = anticipated_movies.title', con=engine)
joined_df

,Movie_Title,Critical_Score,Anticipated_Rank
0,King Arthur: Legend of the Sword,1,29.0
1,Coco,46,23.0
2,Beauty and the Beast,26,22.0
3,Baby Driver,66,21.0
4,Kong: Skull Island,5,15.0
5,Dunkirk,201,13.0
6,Blade Runner 2049,128,12.0
7,John Wick: Chapter 2,10,11.0
8,War for the Planet of the Apes,62,10.0
9,Alien: Covenant,6,9.0
10,The LEGO Batman Movie,27,8.0
11,Thor: Ragnarok,45,7.0
12,Spider-Man: Homecoming,34,6.0
13,Logan,203,5.0
14,Wonder Woman,94,4.0
15,Justice League,18,3.0
16,Get Out,243,NaN
17,Call Me by Your Name,108,NaN
18,It,96,NaN
19,Lady Bird,94,NaN
20,Three Billboards Outside Ebbing Missouri,84,NaN
21,The Disaster Artist,61,NaN
22,Star Wars: The Last Jedi,60,NaN
23,The Shape of Water,57,NaN
24,The Florida Project,55,NaN
25,The Post,47,NaN
26,Phantom Thread,44,NaN
27,The Big Sick,44,NaN
28,Mother!,35,NaN
29,Guardians of the Galaxy Vol. 2,28,NaN
...,...,...,...
77,Hidden Figures,4,NaN
78,I Don't Feel at Home in This World Anymore,4,NaN
79,Princess Cyd,3,NaN
80,Okja,3,NaN
81,The Girl with All the Gifts,3,NaN
82,A Cure for Wellness,2,NaN
83,The Beguiled,2,NaN
84,Jane,2,NaN
85,Bright,2,NaN
86,The Death of Stalin,1,NaN
87,Gemini,1,NaN
88,Happy Death Day,1,NaN
89,American Made,1,NaN
90,Anna and the Apocalypse,1,NaN
91,The Hitman's Bodyguard,1,NaN
92,Beatriz at Dinner,1,NaN
93,Creep 2,1,NaN
94,Lost in Paris,1,NaN
95,Girls Trip,1,NaN
96,I Am Not Your Negro,1,NaN
97,The Babysitter,1,NaN
98,The Breadwinner,0,NaN
99,Dawson City: Frozen Time,0,NaN
100,Their Finest,0,NaN
101,Columbus,0,NaN
102,Brad's Status,0,NaN
103,My Life as a Zucchini,0,NaN
104,Paddington 2,0,NaN
105,Afterimage,0,NaN
106,Ex Libris: The New York Public Library,0,NaN

In [28]:
ranked_df = joined_df.sort_values(["Critical_Score"], ascending=False)
ranked_df.head()

             Movie_Title  Critical_Score  Anticipated_Rank
16               Get Out             243               NaN
13                 Logan             203               5.0
5                Dunkirk             201              13.0
6      Blade Runner 2049             128              12.0
17  Call Me by Your Name             108               NaN

In [29]:
ranked_df.to_csv("Resources/joinedandranked_df.csv")